app/Controllers/UserCharacter.php

    public function index()
    {
        $userId = auth()->user()->id;
        $page = $this->request->getVar('page') ?? 1;

        // Fetch user's characters with pagination
        $total = model('UserCharacter')->where('user_id', $userId)->countAllResults();
        $perPage = 10;

        $characters = model('UserCharacter')->where('user_id', $userId)
                                    ->limit($perPage, ($page - 1) * $perPage)
                                    ->find();
---
SELECT COUNT(*) AS `numrows`
FROM `characters`
WHERE `user_id` = 6
SELECT *
FROM `characters`
WHERE `user_id` = 6
 LIMIT 10